{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "action",
    "1": "adult",
    "2": "adventure",
    "3": "animation",
    "4": "biography",
    "5": "comedy",
    "6": "crime",
    "7": "documentary",
    "8": "drama",
    "9": "family",
    "10": "fantasy",
    "11": "game-show",
    "12": "history",
    "13": "horror",
    "14": "music",
    "15": "musical",
    "16": "mystery",
    "17": "news",
    "18": "reality-tv",
    "19": "romance",
    "20": "sci-fi",
    "21": "short",
    "22": "sport",
    "23": "talk-show",
    "24": "thriller",
    "25": "war",
    "26": "western"
  },
  "initializer_range": 0.02,
  "label2id": {
    "action": 0,
    "adult": 1,
    "adventure": 2,
    "animation": 3,
    "biography": 4,
    "comedy": 5,
    "crime": 6,
    "documentary": 7,
    "drama": 8,
    "family": 9,
    "fantasy": 10,
    "game-show": 11,
    "history": 12,
    "horror": 13,
    "music": 14,
    "musical": 15,
    "mystery": 16,
    "news": 17,
    "reality-tv": 18,
    "romance": 19,
    "sci-fi": 20,
    "short": 21,
    "sport": 22,
    "talk-show": 23,
    "thriller": 24,
    "war": 25,
    "western": 26
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "vocab_size": 30522
}
